Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/demo/m13design/m13_ra6m2_ek/http_server_demo/keil/startup_ra6m2.S
                DCD     SDHIMMC1_CARD_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SDHIMMC1_DMA_REQ != BSP_IRQ_DISABLED
                DCD     SDHIMMC1_DMA_REQ_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCE_PROC_BUSY != BSP_IRQ_DISABLED
                DCD     SCE_PROC_BUSY_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCE_ROMOK != BSP_IRQ_DISABLED
                DCD     SCE_ROMOK_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCE_LONG_PLG != BSP_IRQ_DISABLED
                DCD     SCE_LONG_PLG_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCE_TEST_BUSY != BSP_IRQ_DISABLED
                DCD     SCE_TEST_BUSY_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCE_WRRDY_0 != BSP_IRQ_DISABLED
                DCD     SCE_WRRDY_0_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCE_WRRDY_1 != BSP_IRQ_DISABLED
                DCD     SCE_WRRDY_1_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCE_WRRDY_4 != BSP_IRQ_DISABLED
                DCD     SCE_WRRDY_4_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCE_RDRDY_0 != BSP_IRQ_DISABLED
                DCD     SCE_RDRDY_0_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCE_RDRDY_1 != BSP_IRQ_DISABLED
                DCD     SCE_RDRDY_1_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCE_INTEGRATE_WRRDY != BSP_IRQ_DISABLED
                DCD     SCE_INTEGRATE_WRRDY_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCE_INTEGRATE_RDRDY != BSP_IRQ_DISABLED
                DCD     SCE_INTEGRATE_RDRDY_IRQHandler
                ENDIF
__Vectors_End

__Vectors_Size  EQU  __Vectors_End - __Vectors

                FILL    (0x400 - __Vectors_Size), 0xFFFFFFFF, 4

__Options       DCD     0xFFFFFFFF                 ; Option Function Select Register 0 (OFS0)
                DCD     0xFFFFFDFF                 ; Option Function Select Register 1 (OFS1)
                DCD     0xFFFFFFFC                 ; Security MPU Program Counter Start Address Register 0 (SECMPUPCS0)
                DCD     0xFFFFFFFF                 ; Security MPU Program Counter End Address Register 0 (SECMPUPCE0)
                DCD     0xFFFFFFFC                 ; Security MPU Program Counter Start Address Register 1 (SECMPUPCS1)
                DCD     0xFFFFFFFF                 ; Security MPU Program Counter End Address Register 1 (SECMPUPCE1)
                DCD     0x00FFFFFC                 ; Security MPU Region 0 Start Address Register (SECMPUS0)
                DCD     0x00FFFFFF                 ; Security MPU Region 0 End Address Register (SECMPUE0)
                DCD     0x200FFFFC                 ; Security MPU Region 1 Start Address Register (SECMPUS1)
                DCD     0x200FFFFF                 ; Security MPU Region 1 End Address Register (SECMPUE1)
                DCD     0x407FFFFC                 ; Security MPU Region 2 Start Address Register (SECMPUS2)
                DCD     0x407FFFFF                 ; Security MPU Region 2 End Address Register (SECMPUE2)
                DCD     0x400DFFFC                 ; Security MPU Region 3 Start Address Register (SECMPUS3)
                DCD     0x400DFFFF                 ; Security MPU Region 3 End Address Register (SECMPUE3)
                DCD     0xFFFFFFFF                 ; Security MPU Access Control Register (SECMPUAC)
__Options_End

__Options_Size  EQU  __Options_End - __Options

                FILL    (0x100 - __Options_Size), 0xFFFFFFFF, 4

                AREA    |.text|, CODE, READONLY

; Reset handler
Reset_Handler    PROC
                 EXPORT  Reset_Handler             [WEAK]
        IMPORT  SystemInit
        IMPORT  __main

                 LDR     R0, =SystemInit
                 BLX     R0
                 LDR     R0, =__main
                 BX      R0
                 ENDP

; Dummy Exception Handlers (infinite loops which can be modified)

NMI_Handler     PROC
                EXPORT  NMI_Handler                [WEAK]
                B       .
                ENDP
HardFault_Handler\
                PROC
                EXPORT  HardFault_Handler          [WEAK]
                B       .
                ENDP
MemManage_Handler\
                PROC
                EXPORT  MemManage_Handler          [WEAK]
                B       .
                ENDP
BusFault_Handler\
                PROC
                EXPORT  BusFault_Handler           [WEAK]
                B       .
                ENDP
UsageFault_Handler\
                PROC
                EXPORT  UsageFault_Handler         [WEAK]
                B       .
                ENDP
SVC_Handler     PROC
                EXPORT  SVC_Handler                [WEAK]
                B       .
                ENDP
DebugMon_Handler\
                PROC
                EXPORT  DebugMon_Handler           [WEAK]
                B       .
                ENDP
PendSV_Handler  PROC
                EXPORT  PendSV_Handler             [WEAK]
                B       .
                ENDP
SysTick_Handler PROC
                EXPORT  SysTick_Handler            [WEAK]
                B       .
                ENDP

Default_Handler PROC
                EXPORT  ICU_IRQ0_IRQHandler                  [WEAK]
                EXPORT  ICU_IRQ1_IRQHandler                  [WEAK]
                EXPORT  ICU_IRQ2_IRQHandler                  [WEAK]
                EXPORT  ICU_IRQ3_IRQHandler                  [WEAK]
                EXPORT  ICU_IRQ4_IRQHandler                  [WEAK]
                EXPORT  ICU_IRQ5_IRQHandler                  [WEAK]
                EXPORT  ICU_IRQ6_IRQHandler                  [WEAK]
                EXPORT  ICU_IRQ7_IRQHandler                  [WEAK]
                EXPORT  ICU_IRQ8_IRQHandler                  [WEAK]
                EXPORT  ICU_IRQ9_IRQHandler                  [WEAK]
                EXPORT  ICU_IRQ10_IRQHandler                 [WEAK]
                EXPORT  ICU_IRQ11_IRQHandler                 [WEAK]
                EXPORT  ICU_IRQ12_IRQHandler                 [WEAK]
                EXPORT  ICU_IRQ13_IRQHandler                 [WEAK]
                EXPORT  ICU_IRQ14_IRQHandler                 [WEAK]
                EXPORT  ICU_IRQ15_IRQHandler                 [WEAK]
                EXPORT  DMAC0_INT_IRQHandler                 [WEAK]
                EXPORT  DMAC1_INT_IRQHandler                 [WEAK]
                EXPORT  DMAC2_INT_IRQHandler                 [WEAK]
                EXPORT  DMAC3_INT_IRQHandler                 [WEAK]
                EXPORT  DMAC4_INT_IRQHandler                 [WEAK]
                EXPORT  DMAC5_INT_IRQHandler                 [WEAK]
                EXPORT  DMAC6_INT_IRQHandler                 [WEAK]
                EXPORT  DMAC7_INT_IRQHandler                 [WEAK]
                EXPORT  DTC_COMPLETE_IRQHandler              [WEAK]
                EXPORT  DTC_END_IRQHandler                   [WEAK]
                EXPORT  ICU_SNOOZE_CANCEL_IRQHandler         [WEAK]
                EXPORT  FCU_FIFERR_IRQHandler                [WEAK]
                EXPORT  FCU_FRDYI_IRQHandler                 [WEAK]
                EXPORT  LVD_LVD1_IRQHandler                  [WEAK]
                EXPORT  LVD_LVD2_IRQHandler                  [WEAK]
                EXPORT  CGC_MOSC_STOP_IRQHandler             [WEAK]
                EXPORT  LPM_SNOOZE_REQUEST_IRQHandler        [WEAK]
                EXPORT  AGT0_INT_IRQHandler                  [WEAK]
                EXPORT  AGT0_COMPARE_A_IRQHandler            [WEAK]
                EXPORT  AGT0_COMPARE_B_IRQHandler            [WEAK]
                EXPORT  AGT1_INT_IRQHandler                  [WEAK]
                EXPORT  AGT1_COMPARE_A_IRQHandler            [WEAK]
                EXPORT  AGT1_COMPARE_B_IRQHandler            [WEAK]
                EXPORT  IWDT_UNDERFLOW_IRQHandler            [WEAK]
                EXPORT  WDT_UNDERFLOW_IRQHandler             [WEAK]
                EXPORT  RTC_ALARM_IRQHandler                 [WEAK]
                EXPORT  RTC_PERIOD_IRQHandler                [WEAK]
                EXPORT  RTC_CARRY_IRQHandler                 [WEAK]
                EXPORT  ADC0_SCAN_END_IRQHandler             [WEAK]
                EXPORT  ADC0_SCAN_END_B_IRQHandler           [WEAK]
                EXPORT  ADC0_WINDOW_A_IRQHandler             [WEAK]
                EXPORT  ADC0_WINDOW_B_IRQHandler             [WEAK]
                EXPORT  ADC0_COMPARE_MATCH_IRQHandler        [WEAK]
                EXPORT  ADC0_COMPARE_MISMATCH_IRQHandler     [WEAK]
                EXPORT  ADC1_SCAN_END_IRQHandler             [WEAK]
                EXPORT  ADC1_SCAN_END_B_IRQHandler           [WEAK]
                EXPORT  ADC1_WINDOW_A_IRQHandler             [WEAK]
                EXPORT  ADC1_WINDOW_B_IRQHandler             [WEAK]
                EXPORT  ADC1_COMPARE_MATCH_IRQHandler        [WEAK]
                EXPORT  ADC1_COMPARE_MISMATCH_IRQHandler     [WEAK]
                EXPORT  ACMPHS0_INT_IRQHandler               [WEAK]
                EXPORT  ACMPHS1_INT_IRQHandler               [WEAK]
                EXPORT  ACMPHS2_INT_IRQHandler               [WEAK]
                EXPORT  ACMPHS3_INT_IRQHandler               [WEAK]
                EXPORT  ACMPHS4_INT_IRQHandler               [WEAK]
                EXPORT  ACMPHS5_INT_IRQHandler               [WEAK]
                EXPORT  USBFS_FIFO_0_IRQHandler              [WEAK]
                EXPORT  USBFS_FIFO_1_IRQHandler              [WEAK]
                EXPORT  USBFS_INT_IRQHandler                 [WEAK]
                EXPORT  USBFS_RESUME_IRQHandler              [WEAK]
                EXPORT  IIC0_RXI_IRQHandler                  [WEAK]
                EXPORT  IIC0_TXI_IRQHandler                  [WEAK]
                EXPORT  IIC0_TEI_IRQHandler                  [WEAK]
                EXPORT  IIC0_ERI_IRQHandler                  [WEAK]
                EXPORT  IIC0_WUI_IRQHandler                  [WEAK]
                EXPORT  IIC1_RXI_IRQHandler                  [WEAK]
                EXPORT  IIC1_TXI_IRQHandler                  [WEAK]
                EXPORT  IIC1_TEI_IRQHandler                  [WEAK]
                EXPORT  IIC1_ERI_IRQHandler                  [WEAK]
                EXPORT  IIC2_RXI_IRQHandler                  [WEAK]
                EXPORT  IIC2_TXI_IRQHandler                  [WEAK]
                EXPORT  IIC2_TEI_IRQHandler                  [WEAK]
                EXPORT  IIC2_ERI_IRQHandler                  [WEAK]
                EXPORT  SSI0_TXI_IRQHandler                  [WEAK]
                EXPORT  SSI0_RXI_IRQHandler                  [WEAK]
                EXPORT  SSI0_INT_IRQHandler                  [WEAK]
                EXPORT  SRC_INPUT_FIFO_EMPTY_IRQHandler      [WEAK]
                EXPORT  SRC_OUTPUT_FIFO_FULL_IRQHandler      [WEAK]
                EXPORT  SRC_OUTPUT_FIFO_OVERFLOW_IRQHandler  [WEAK]
                EXPORT  SRC_OUTPUT_FIFO_UNDERFLOW_IRQHandler [WEAK]
                EXPORT  SRC_CONVERSION_END_IRQHandler        [WEAK]
                EXPORT  PDC_RECEIVE_DATA_READY_IRQHandler    [WEAK]
                EXPORT  PDC_FRAME_END_IRQHandler             [WEAK]
                EXPORT  PDC_INT_IRQHandler                   [WEAK]
                EXPORT  CTSU_WRITE_IRQHandler                [WEAK]
                EXPORT  CTSU_READ_IRQHandler                 [WEAK]
                EXPORT  CTSU_END_IRQHandler                  [WEAK]
                EXPORT  KEY_INT_IRQHandler                   [WEAK]
                EXPORT  DOC_INT_IRQHandler                   [WEAK]
                EXPORT  CAC_FREQUENCY_ERROR_IRQHandler       [WEAK]
                EXPORT  CAC_MEASUREMENT_END_IRQHandler       [WEAK]
                EXPORT  CAC_OVERFLOW_IRQHandler              [WEAK]
                EXPORT  CAN0_ERROR_IRQHandler                [WEAK]
                EXPORT  CAN0_FIFO_RX_IRQHandler              [WEAK]
                EXPORT  CAN0_FIFO_TX_IRQHandler              [WEAK]
                EXPORT  CAN0_MAILBOX_RX_IRQHandler           [WEAK]
                EXPORT  CAN0_MAILBOX_TX_IRQHandler           [WEAK]
                EXPORT  CAN1_ERROR_IRQHandler                [WEAK]
                EXPORT  CAN1_FIFO_RX_IRQHandler              [WEAK]
                EXPORT  CAN1_FIFO_TX_IRQHandler              [WEAK]
                EXPORT  CAN1_MAILBOX_RX_IRQHandler           [WEAK]
                EXPORT  CAN1_MAILBOX_TX_IRQHandler           [WEAK]
                EXPORT  IOPORT_EVENT_1_IRQHandler            [WEAK]
                EXPORT  IOPORT_EVENT_2_IRQHandler            [WEAK]
                EXPORT  IOPORT_EVENT_3_IRQHandler            [WEAK]
                EXPORT  IOPORT_EVENT_4_IRQHandler            [WEAK]
                EXPORT  ELC_SOFTWARE_EVENT_0_IRQHandler      [WEAK]
                EXPORT  ELC_SOFTWARE_EVENT_1_IRQHandler      [WEAK]
                EXPORT  POEG0_EVENT_IRQHandler               [WEAK]
                EXPORT  POEG1_EVENT_IRQHandler               [WEAK]
                EXPORT  POEG2_EVENT_IRQHandler               [WEAK]
                EXPORT  POEG3_EVENT_IRQHandler               [WEAK]
                EXPORT  GPT0_CAPTURE_COMPARE_A_IRQHandler    [WEAK]
                EXPORT  GPT0_CAPTURE_COMPARE_B_IRQHandler    [WEAK]
                EXPORT  GPT0_COMPARE_C_IRQHandler            [WEAK]
                EXPORT  GPT0_COMPARE_D_IRQHandler            [WEAK]
                EXPORT  GPT0_COMPARE_E_IRQHandler            [WEAK]
                EXPORT  GPT0_COMPARE_F_IRQHandler            [WEAK]
                EXPORT  GPT0_COUNTER_OVERFLOW_IRQHandler     [WEAK]
                EXPORT  GPT0_COUNTER_UNDERFLOW_IRQHandler    [WEAK]
                EXPORT  GPT0_AD_TRIG_A_IRQHandler            [WEAK]
                EXPORT  GPT0_AD_TRIG_B_IRQHandler            [WEAK]
                EXPORT  GPT1_CAPTURE_COMPARE_A_IRQHandler    [WEAK]
                EXPORT  GPT1_CAPTURE_COMPARE_B_IRQHandler    [WEAK]
                EXPORT  GPT1_COMPARE_C_IRQHandler            [WEAK]
                EXPORT  GPT1_COMPARE_D_IRQHandler            [WEAK]
                EXPORT  GPT1_COMPARE_E_IRQHandler            [WEAK]
                EXPORT  GPT1_COMPARE_F_IRQHandler            [WEAK]
                EXPORT  GPT1_COUNTER_OVERFLOW_IRQHandler     [WEAK]
                EXPORT  GPT1_COUNTER_UNDERFLOW_IRQHandler    [WEAK]
                EXPORT  GPT1_AD_TRIG_A_IRQHandler            [WEAK]
                EXPORT  GPT1_AD_TRIG_B_IRQHandler            [WEAK]
                EXPORT  GPT2_CAPTURE_COMPARE_A_IRQHandler    [WEAK]
                EXPORT  GPT2_CAPTURE_COMPARE_B_IRQHandler    [WEAK]
                EXPORT  GPT2_COMPARE_C_IRQHandler            [WEAK]
                EXPORT  GPT2_COMPARE_D_IRQHandler            [WEAK]
                EXPORT  GPT2_COMPARE_E_IRQHandler            [WEAK]
                EXPORT  GPT2_COMPARE_F_IRQHandler            [WEAK]
                EXPORT  GPT2_COUNTER_OVERFLOW_IRQHandler     [WEAK]
                EXPORT  GPT2_COUNTER_UNDERFLOW_IRQHandler    [WEAK]
                EXPORT  GPT2_AD_TRIG_A_IRQHandler            [WEAK]
                EXPORT  GPT2_AD_TRIG_B_IRQHandler            [WEAK]
                EXPORT  GPT3_CAPTURE_COMPARE_A_IRQHandler    [WEAK]
                EXPORT  GPT3_CAPTURE_COMPARE_B_IRQHandler    [WEAK]
                EXPORT  GPT3_COMPARE_C_IRQHandler            [WEAK]
                EXPORT  GPT3_COMPARE_D_IRQHandler            [WEAK]
                EXPORT  GPT3_COMPARE_E_IRQHandler            [WEAK]
                EXPORT  GPT3_COMPARE_F_IRQHandler            [WEAK]
                EXPORT  GPT3_COUNTER_OVERFLOW_IRQHandler     [WEAK]
                EXPORT  GPT3_COUNTER_UNDERFLOW_IRQHandler    [WEAK]
                EXPORT  GPT3_AD_TRIG_A_IRQHandler            [WEAK]
                EXPORT  GPT3_AD_TRIG_B_IRQHandler            [WEAK]
                EXPORT  GPT4_CAPTURE_COMPARE_A_IRQHandler    [WEAK]
                EXPORT  GPT4_CAPTURE_COMPARE_B_IRQHandler    [WEAK]
                EXPORT  GPT4_COMPARE_C_IRQHandler            [WEAK]
                EXPORT  GPT4_COMPARE_D_IRQHandler            [WEAK]
                EXPORT  GPT4_COMPARE_E_IRQHandler            [WEAK]
                EXPORT  GPT4_COMPARE_F_IRQHandler            [WEAK]
                EXPORT  GPT4_COUNTER_OVERFLOW_IRQHandler     [WEAK]
                EXPORT  GPT4_COUNTER_UNDERFLOW_IRQHandler    [WEAK]
                EXPORT  GPT4_AD_TRIG_A_IRQHandler            [WEAK]
                EXPORT  GPT4_AD_TRIG_B_IRQHandler            [WEAK]
                EXPORT  GPT5_CAPTURE_COMPARE_A_IRQHandler    [WEAK]
                EXPORT  GPT5_CAPTURE_COMPARE_B_IRQHandler    [WEAK]
                EXPORT  GPT5_COMPARE_C_IRQHandler            [WEAK]
                EXPORT  GPT5_COMPARE_D_IRQHandler            [WEAK]
                EXPORT  GPT5_COMPARE_E_IRQHandler            [WEAK]
                EXPORT  GPT5_COMPARE_F_IRQHandler            [WEAK]
                EXPORT  GPT5_COUNTER_OVERFLOW_IRQHandler     [WEAK]
                EXPORT  GPT5_COUNTER_UNDERFLOW_IRQHandler    [WEAK]
                EXPORT  GPT5_AD_TRIG_A_IRQHandler            [WEAK]
                EXPORT  GPT5_AD_TRIG_B_IRQHandler            [WEAK]
                EXPORT  GPT6_CAPTURE_COMPARE_A_IRQHandler    [WEAK]
                EXPORT  GPT6_CAPTURE_COMPARE_B_IRQHandler    [WEAK]
                EXPORT  GPT6_COMPARE_C_IRQHandler            [WEAK]
                EXPORT  GPT6_COMPARE_D_IRQHandler            [WEAK]
                EXPORT  GPT6_COMPARE_E_IRQHandler            [WEAK]
                EXPORT  GPT6_COMPARE_F_IRQHandler            [WEAK]
                EXPORT  GPT6_COUNTER_OVERFLOW_IRQHandler     [WEAK]
                EXPORT  GPT6_COUNTER_UNDERFLOW_IRQHandler    [WEAK]
                EXPORT  GPT6_AD_TRIG_A_IRQHandler            [WEAK]
                EXPORT  GPT6_AD_TRIG_B_IRQHandler            [WEAK]
                EXPORT  GPT7_CAPTURE_COMPARE_A_IRQHandler    [WEAK]
                EXPORT  GPT7_CAPTURE_COMPARE_B_IRQHandler    [WEAK]
                EXPORT  GPT7_COMPARE_C_IRQHandler            [WEAK]
                EXPORT  GPT7_COMPARE_D_IRQHandler            [WEAK]
                EXPORT  GPT7_COMPARE_E_IRQHandler            [WEAK]
                EXPORT  GPT7_COMPARE_F_IRQHandler            [WEAK]
                EXPORT  GPT7_COUNTER_OVERFLOW_IRQHandler     [WEAK]
                EXPORT  GPT7_COUNTER_UNDERFLOW_IRQHandler    [WEAK]
                EXPORT  GPT7_AD_TRIG_A_IRQHandler            [WEAK]
                EXPORT  GPT7_AD_TRIG_B_IRQHandler            [WEAK]
                EXPORT  GPT8_CAPTURE_COMPARE_A_IRQHandler    [WEAK]
                EXPORT  GPT8_CAPTURE_COMPARE_B_IRQHandler    [WEAK]
                EXPORT  GPT8_COMPARE_C_IRQHandler            [WEAK]
                EXPORT  GPT8_COMPARE_D_IRQHandler            [WEAK]
                EXPORT  GPT8_COMPARE_E_IRQHandler            [WEAK]
                EXPORT  GPT8_COMPARE_F_IRQHandler            [WEAK]
                EXPORT  GPT8_COUNTER_OVERFLOW_IRQHandler     [WEAK]
                EXPORT  GPT8_COUNTER_UNDERFLOW_IRQHandler    [WEAK]
                EXPORT  GPT9_CAPTURE_COMPARE_A_IRQHandler    [WEAK]
                EXPORT  GPT9_CAPTURE_COMPARE_B_IRQHandler    [WEAK]
                EXPORT  GPT9_COMPARE_C_IRQHandler            [WEAK]
                EXPORT  GPT9_COMPARE_D_IRQHandler            [WEAK]
                EXPORT  GPT9_COMPARE_E_IRQHandler            [WEAK]
                EXPORT  GPT9_COMPARE_F_IRQHandler            [WEAK]
                EXPORT  GPT9_COUNTER_OVERFLOW_IRQHandler     [WEAK]
                EXPORT  GPT9_COUNTER_UNDERFLOW_IRQHandler    [WEAK]
                EXPORT  GPT10_CAPTURE_COMPARE_A_IRQHandler   [WEAK]
                EXPORT  GPT10_CAPTURE_COMPARE_B_IRQHandler   [WEAK]
                EXPORT  GPT10_COMPARE_C_IRQHandler           [WEAK]
                EXPORT  GPT10_COMPARE_D_IRQHandler           [WEAK]
                EXPORT  GPT10_COMPARE_E_IRQHandler           [WEAK]
                EXPORT  GPT10_COMPARE_F_IRQHandler           [WEAK]
                EXPORT  GPT10_COUNTER_OVERFLOW_IRQHandler    [WEAK]
                EXPORT  GPT10_COUNTER_UNDERFLOW_IRQHandler   [WEAK]
                EXPORT  GPT11_CAPTURE_COMPARE_A_IRQHandler   [WEAK]
                EXPORT  GPT11_CAPTURE_COMPARE_B_IRQHandler   [WEAK]
                EXPORT  GPT11_COMPARE_C_IRQHandler           [WEAK]
                EXPORT  GPT11_COMPARE_D_IRQHandler           [WEAK]
                EXPORT  GPT11_COMPARE_E_IRQHandler           [WEAK]
                EXPORT  GPT11_COMPARE_F_IRQHandler           [WEAK]
                EXPORT  GPT11_COUNTER_OVERFLOW_IRQHandler    [WEAK]
                EXPORT  GPT11_COUNTER_UNDERFLOW_IRQHandler   [WEAK]
                EXPORT  GPT12_CAPTURE_COMPARE_A_IRQHandler   [WEAK]
                EXPORT  GPT12_CAPTURE_COMPARE_B_IRQHandler   [WEAK]
                EXPORT  GPT12_COMPARE_C_IRQHandler           [WEAK]
                EXPORT  GPT12_COMPARE_D_IRQHandler           [WEAK]
                EXPORT  GPT12_COMPARE_E_IRQHandler           [WEAK]
                EXPORT  GPT12_COMPARE_F_IRQHandler           [WEAK]
                EXPORT  GPT12_COUNTER_OVERFLOW_IRQHandler    [WEAK]
                EXPORT  GPT12_COUNTER_UNDERFLOW_IRQHandler   [WEAK]
                EXPORT  GPT13_CAPTURE_COMPARE_A_IRQHandler   [WEAK]
                EXPORT  GPT13_CAPTURE_COMPARE_B_IRQHandler   [WEAK]
                EXPORT  GPT13_COMPARE_C_IRQHandler           [WEAK]
                EXPORT  GPT13_COMPARE_D_IRQHandler           [WEAK]
                EXPORT  GPT13_COMPARE_E_IRQHandler           [WEAK]
                EXPORT  GPT13_COMPARE_F_IRQHandler           [WEAK]
                EXPORT  GPT13_COUNTER_OVERFLOW_IRQHandler    [WEAK]
                EXPORT  GPT13_COUNTER_UNDERFLOW_IRQHandler   [WEAK]
                EXPORT  OPS_UVW_EDGE_IRQHandler              [WEAK]
                EXPORT  EDMAC0_EINT_IRQHandler               [WEAK]
                EXPORT  SCI0_RXI_IRQHandler                  [WEAK]
                EXPORT  SCI0_TXI_IRQHandler                  [WEAK]
                EXPORT  SCI0_TEI_IRQHandler                  [WEAK]
                EXPORT  SCI0_ERI_IRQHandler                  [WEAK]
                EXPORT  SCI0_AM_IRQHandler                   [WEAK]
                EXPORT  SCI0_RXI_OR_ERI_IRQHandler           [WEAK]
                EXPORT  SCI1_RXI_IRQHandler                  [WEAK]
                EXPORT  SCI1_TXI_IRQHandler                  [WEAK]
                EXPORT  SCI1_TEI_IRQHandler                  [WEAK]
                EXPORT  SCI1_ERI_IRQHandler                  [WEAK]
                EXPORT  SCI1_AM_IRQHandler                   [WEAK]
                EXPORT  SCI2_RXI_IRQHandler                  [WEAK]
                EXPORT  SCI2_TXI_IRQHandler                  [WEAK]
                EXPORT  SCI2_TEI_IRQHandler                  [WEAK]
                EXPORT  SCI2_ERI_IRQHandler                  [WEAK]
                EXPORT  SCI2_AM_IRQHandler                   [WEAK]
                EXPORT  SCI3_RXI_IRQHandler                  [WEAK]
                EXPORT  SCI3_TXI_IRQHandler                  [WEAK]
                EXPORT  SCI3_TEI_IRQHandler                  [WEAK]
                EXPORT  SCI3_ERI_IRQHandler                  [WEAK]
