Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/demo/m13design/m13_ra6m2_ek/http_server_demo/keil/startup_ra6m2.S
                EXPORT  SCI3_AM_IRQHandler                   [WEAK]
                EXPORT  SCI4_RXI_IRQHandler                  [WEAK]
                EXPORT  SCI4_TXI_IRQHandler                  [WEAK]
                EXPORT  SCI4_TEI_IRQHandler                  [WEAK]
                EXPORT  SCI4_ERI_IRQHandler                  [WEAK]
                EXPORT  SCI4_AM_IRQHandler                   [WEAK]
                EXPORT  SCI5_RXI_IRQHandler                  [WEAK]
                EXPORT  SCI5_TXI_IRQHandler                  [WEAK]
                EXPORT  SCI5_TEI_IRQHandler                  [WEAK]
                EXPORT  SCI5_ERI_IRQHandler                  [WEAK]
                EXPORT  SCI5_AM_IRQHandler                   [WEAK]
                EXPORT  SCI6_RXI_IRQHandler                  [WEAK]
                EXPORT  SCI6_TXI_IRQHandler                  [WEAK]
                EXPORT  SCI6_TEI_IRQHandler                  [WEAK]
                EXPORT  SCI6_ERI_IRQHandler                  [WEAK]
                EXPORT  SCI6_AM_IRQHandler                   [WEAK]
                EXPORT  SCI7_RXI_IRQHandler                  [WEAK]
                EXPORT  SCI7_TXI_IRQHandler                  [WEAK]
                EXPORT  SCI7_TEI_IRQHandler                  [WEAK]
                EXPORT  SCI7_ERI_IRQHandler                  [WEAK]
                EXPORT  SCI7_AM_IRQHandler                   [WEAK]
                EXPORT  SCI8_RXI_IRQHandler                  [WEAK]
                EXPORT  SCI8_TXI_IRQHandler                  [WEAK]
                EXPORT  SCI8_TEI_IRQHandler                  [WEAK]
                EXPORT  SCI8_ERI_IRQHandler                  [WEAK]
                EXPORT  SCI8_AM_IRQHandler                   [WEAK]
                EXPORT  SCI9_RXI_IRQHandler                  [WEAK]
                EXPORT  SCI9_TXI_IRQHandler                  [WEAK]
                EXPORT  SCI9_TEI_IRQHandler                  [WEAK]
                EXPORT  SCI9_ERI_IRQHandler                  [WEAK]
                EXPORT  SCI9_AM_IRQHandler                   [WEAK]
                EXPORT  SPI0_RXI_IRQHandler                  [WEAK]
                EXPORT  SPI0_TXI_IRQHandler                  [WEAK]
                EXPORT  SPI0_IDLE_IRQHandler                 [WEAK]
                EXPORT  SPI0_ERI_IRQHandler                  [WEAK]
                EXPORT  SPI0_TEI_IRQHandler                  [WEAK]
                EXPORT  SPI1_RXI_IRQHandler                  [WEAK]
                EXPORT  SPI1_TXI_IRQHandler                  [WEAK]
                EXPORT  SPI1_IDLE_IRQHandler                 [WEAK]
                EXPORT  SPI1_ERI_IRQHandler                  [WEAK]
                EXPORT  SPI1_TEI_IRQHandler                  [WEAK]
                EXPORT  QSPI_INT_IRQHandler                  [WEAK]
                EXPORT  SDHIMMC0_ACCS_IRQHandler             [WEAK]
                EXPORT  SDHIMMC0_SDIO_IRQHandler             [WEAK]
                EXPORT  SDHIMMC0_CARD_IRQHandler             [WEAK]
                EXPORT  SDHIMMC0_DMA_REQ_IRQHandler          [WEAK]
                EXPORT  SDHIMMC1_ACCS_IRQHandler             [WEAK]
                EXPORT  SDHIMMC1_SDIO_IRQHandler             [WEAK]
                EXPORT  SDHIMMC1_CARD_IRQHandler             [WEAK]
                EXPORT  SDHIMMC1_DMA_REQ_IRQHandler          [WEAK]
                EXPORT  SCE_PROC_BUSY_IRQHandler             [WEAK]
                EXPORT  SCE_ROMOK_IRQHandler                 [WEAK]
                EXPORT  SCE_LONG_PLG_IRQHandler              [WEAK]
                EXPORT  SCE_TEST_BUSY_IRQHandler             [WEAK]
                EXPORT  SCE_WRRDY_0_IRQHandler               [WEAK]
                EXPORT  SCE_WRRDY_1_IRQHandler               [WEAK]
                EXPORT  SCE_WRRDY_4_IRQHandler               [WEAK]
                EXPORT  SCE_RDRDY_0_IRQHandler               [WEAK]
                EXPORT  SCE_RDRDY_1_IRQHandler               [WEAK]
                EXPORT  SCE_INTEGRATE_WRRDY_IRQHandler       [WEAK]
                EXPORT  SCE_INTEGRATE_RDRDY_IRQHandler       [WEAK]

ICU_IRQ0_IRQHandler
ICU_IRQ1_IRQHandler
ICU_IRQ2_IRQHandler
ICU_IRQ3_IRQHandler
ICU_IRQ4_IRQHandler
ICU_IRQ5_IRQHandler
ICU_IRQ6_IRQHandler
ICU_IRQ7_IRQHandler
ICU_IRQ8_IRQHandler
ICU_IRQ9_IRQHandler
ICU_IRQ10_IRQHandler
ICU_IRQ11_IRQHandler
ICU_IRQ12_IRQHandler
ICU_IRQ13_IRQHandler
ICU_IRQ14_IRQHandler
ICU_IRQ15_IRQHandler
DMAC0_INT_IRQHandler
DMAC1_INT_IRQHandler
DMAC2_INT_IRQHandler
DMAC3_INT_IRQHandler
DMAC4_INT_IRQHandler
DMAC5_INT_IRQHandler
DMAC6_INT_IRQHandler
DMAC7_INT_IRQHandler
DTC_COMPLETE_IRQHandler
DTC_END_IRQHandler
ICU_SNOOZE_CANCEL_IRQHandler
FCU_FIFERR_IRQHandler
FCU_FRDYI_IRQHandler
LVD_LVD1_IRQHandler
LVD_LVD2_IRQHandler
CGC_MOSC_STOP_IRQHandler
LPM_SNOOZE_REQUEST_IRQHandler
AGT0_INT_IRQHandler
AGT0_COMPARE_A_IRQHandler
AGT0_COMPARE_B_IRQHandler
AGT1_INT_IRQHandler
AGT1_COMPARE_A_IRQHandler
AGT1_COMPARE_B_IRQHandler
IWDT_UNDERFLOW_IRQHandler
WDT_UNDERFLOW_IRQHandler
RTC_ALARM_IRQHandler
RTC_PERIOD_IRQHandler
RTC_CARRY_IRQHandler
ADC0_SCAN_END_IRQHandler
ADC0_SCAN_END_B_IRQHandler
ADC0_WINDOW_A_IRQHandler
ADC0_WINDOW_B_IRQHandler
ADC0_COMPARE_MATCH_IRQHandler
ADC0_COMPARE_MISMATCH_IRQHandler
ADC1_SCAN_END_IRQHandler
ADC1_SCAN_END_B_IRQHandler
ADC1_WINDOW_A_IRQHandler
ADC1_WINDOW_B_IRQHandler
ADC1_COMPARE_MATCH_IRQHandler
ADC1_COMPARE_MISMATCH_IRQHandler
ACMPHS0_INT_IRQHandler
ACMPHS1_INT_IRQHandler
ACMPHS2_INT_IRQHandler
ACMPHS3_INT_IRQHandler
ACMPHS4_INT_IRQHandler
ACMPHS5_INT_IRQHandler
USBFS_FIFO_0_IRQHandler
USBFS_FIFO_1_IRQHandler
USBFS_INT_IRQHandler
USBFS_RESUME_IRQHandler
IIC0_RXI_IRQHandler
IIC0_TXI_IRQHandler
IIC0_TEI_IRQHandler
IIC0_ERI_IRQHandler
IIC0_WUI_IRQHandler
IIC1_RXI_IRQHandler
IIC1_TXI_IRQHandler
IIC1_TEI_IRQHandler
IIC1_ERI_IRQHandler
IIC2_RXI_IRQHandler
IIC2_TXI_IRQHandler
IIC2_TEI_IRQHandler
IIC2_ERI_IRQHandler
SSI0_TXI_IRQHandler
SSI0_RXI_IRQHandler
SSI0_INT_IRQHandler
SRC_INPUT_FIFO_EMPTY_IRQHandler
SRC_OUTPUT_FIFO_FULL_IRQHandler
SRC_OUTPUT_FIFO_OVERFLOW_IRQHandler
SRC_OUTPUT_FIFO_UNDERFLOW_IRQHandler
SRC_CONVERSION_END_IRQHandler
PDC_RECEIVE_DATA_READY_IRQHandler
PDC_FRAME_END_IRQHandler
PDC_INT_IRQHandler
CTSU_WRITE_IRQHandler
CTSU_READ_IRQHandler
CTSU_END_IRQHandler
KEY_INT_IRQHandler
DOC_INT_IRQHandler
CAC_FREQUENCY_ERROR_IRQHandler
CAC_MEASUREMENT_END_IRQHandler
CAC_OVERFLOW_IRQHandler
CAN0_ERROR_IRQHandler
CAN0_FIFO_RX_IRQHandler
CAN0_FIFO_TX_IRQHandler
CAN0_MAILBOX_RX_IRQHandler
CAN0_MAILBOX_TX_IRQHandler
CAN1_ERROR_IRQHandler
CAN1_FIFO_RX_IRQHandler
CAN1_FIFO_TX_IRQHandler
CAN1_MAILBOX_RX_IRQHandler
CAN1_MAILBOX_TX_IRQHandler
IOPORT_EVENT_1_IRQHandler
IOPORT_EVENT_2_IRQHandler
IOPORT_EVENT_3_IRQHandler
IOPORT_EVENT_4_IRQHandler
ELC_SOFTWARE_EVENT_0_IRQHandler
ELC_SOFTWARE_EVENT_1_IRQHandler
POEG0_EVENT_IRQHandler
POEG1_EVENT_IRQHandler
POEG2_EVENT_IRQHandler
POEG3_EVENT_IRQHandler
GPT0_CAPTURE_COMPARE_A_IRQHandler
GPT0_CAPTURE_COMPARE_B_IRQHandler
GPT0_COMPARE_C_IRQHandler
GPT0_COMPARE_D_IRQHandler
GPT0_COMPARE_E_IRQHandler
GPT0_COMPARE_F_IRQHandler
GPT0_COUNTER_OVERFLOW_IRQHandler
GPT0_COUNTER_UNDERFLOW_IRQHandler
GPT0_AD_TRIG_A_IRQHandler
GPT0_AD_TRIG_B_IRQHandler
GPT1_CAPTURE_COMPARE_A_IRQHandler
GPT1_CAPTURE_COMPARE_B_IRQHandler
GPT1_COMPARE_C_IRQHandler
GPT1_COMPARE_D_IRQHandler
GPT1_COMPARE_E_IRQHandler
GPT1_COMPARE_F_IRQHandler
GPT1_COUNTER_OVERFLOW_IRQHandler
GPT1_COUNTER_UNDERFLOW_IRQHandler
GPT1_AD_TRIG_A_IRQHandler
GPT1_AD_TRIG_B_IRQHandler
GPT2_CAPTURE_COMPARE_A_IRQHandler
GPT2_CAPTURE_COMPARE_B_IRQHandler
GPT2_COMPARE_C_IRQHandler
GPT2_COMPARE_D_IRQHandler
GPT2_COMPARE_E_IRQHandler
GPT2_COMPARE_F_IRQHandler
GPT2_COUNTER_OVERFLOW_IRQHandler
GPT2_COUNTER_UNDERFLOW_IRQHandler
GPT2_AD_TRIG_A_IRQHandler
GPT2_AD_TRIG_B_IRQHandler
GPT3_CAPTURE_COMPARE_A_IRQHandler
GPT3_CAPTURE_COMPARE_B_IRQHandler
GPT3_COMPARE_C_IRQHandler
GPT3_COMPARE_D_IRQHandler
GPT3_COMPARE_E_IRQHandler
GPT3_COMPARE_F_IRQHandler
GPT3_COUNTER_OVERFLOW_IRQHandler
GPT3_COUNTER_UNDERFLOW_IRQHandler
GPT3_AD_TRIG_A_IRQHandler
GPT3_AD_TRIG_B_IRQHandler
GPT4_CAPTURE_COMPARE_A_IRQHandler
GPT4_CAPTURE_COMPARE_B_IRQHandler
GPT4_COMPARE_C_IRQHandler
GPT4_COMPARE_D_IRQHandler
GPT4_COMPARE_E_IRQHandler
GPT4_COMPARE_F_IRQHandler
GPT4_COUNTER_OVERFLOW_IRQHandler
GPT4_COUNTER_UNDERFLOW_IRQHandler
GPT4_AD_TRIG_A_IRQHandler
GPT4_AD_TRIG_B_IRQHandler
GPT5_CAPTURE_COMPARE_A_IRQHandler
GPT5_CAPTURE_COMPARE_B_IRQHandler
GPT5_COMPARE_C_IRQHandler
GPT5_COMPARE_D_IRQHandler
GPT5_COMPARE_E_IRQHandler
GPT5_COMPARE_F_IRQHandler
GPT5_COUNTER_OVERFLOW_IRQHandler
GPT5_COUNTER_UNDERFLOW_IRQHandler
GPT5_AD_TRIG_A_IRQHandler
GPT5_AD_TRIG_B_IRQHandler
GPT6_CAPTURE_COMPARE_A_IRQHandler
GPT6_CAPTURE_COMPARE_B_IRQHandler
GPT6_COMPARE_C_IRQHandler
GPT6_COMPARE_D_IRQHandler
GPT6_COMPARE_E_IRQHandler
GPT6_COMPARE_F_IRQHandler
GPT6_COUNTER_OVERFLOW_IRQHandler
GPT6_COUNTER_UNDERFLOW_IRQHandler
GPT6_AD_TRIG_A_IRQHandler
GPT6_AD_TRIG_B_IRQHandler
GPT7_CAPTURE_COMPARE_A_IRQHandler
GPT7_CAPTURE_COMPARE_B_IRQHandler
GPT7_COMPARE_C_IRQHandler
GPT7_COMPARE_D_IRQHandler
GPT7_COMPARE_E_IRQHandler
GPT7_COMPARE_F_IRQHandler
GPT7_COUNTER_OVERFLOW_IRQHandler
GPT7_COUNTER_UNDERFLOW_IRQHandler
GPT7_AD_TRIG_A_IRQHandler
GPT7_AD_TRIG_B_IRQHandler
GPT8_CAPTURE_COMPARE_A_IRQHandler
GPT8_CAPTURE_COMPARE_B_IRQHandler
GPT8_COMPARE_C_IRQHandler
GPT8_COMPARE_D_IRQHandler
GPT8_COMPARE_E_IRQHandler
GPT8_COMPARE_F_IRQHandler
GPT8_COUNTER_OVERFLOW_IRQHandler
GPT8_COUNTER_UNDERFLOW_IRQHandler
GPT9_CAPTURE_COMPARE_A_IRQHandler
GPT9_CAPTURE_COMPARE_B_IRQHandler
GPT9_COMPARE_C_IRQHandler
GPT9_COMPARE_D_IRQHandler
GPT9_COMPARE_E_IRQHandler
GPT9_COMPARE_F_IRQHandler
GPT9_COUNTER_OVERFLOW_IRQHandler
GPT9_COUNTER_UNDERFLOW_IRQHandler
GPT10_CAPTURE_COMPARE_A_IRQHandler
GPT10_CAPTURE_COMPARE_B_IRQHandler
GPT10_COMPARE_C_IRQHandler
GPT10_COMPARE_D_IRQHandler
GPT10_COMPARE_E_IRQHandler
GPT10_COMPARE_F_IRQHandler
GPT10_COUNTER_OVERFLOW_IRQHandler
GPT10_COUNTER_UNDERFLOW_IRQHandler
GPT11_CAPTURE_COMPARE_A_IRQHandler
GPT11_CAPTURE_COMPARE_B_IRQHandler
GPT11_COMPARE_C_IRQHandler
GPT11_COMPARE_D_IRQHandler
GPT11_COMPARE_E_IRQHandler
GPT11_COMPARE_F_IRQHandler
GPT11_COUNTER_OVERFLOW_IRQHandler
GPT11_COUNTER_UNDERFLOW_IRQHandler
GPT12_CAPTURE_COMPARE_A_IRQHandler
GPT12_CAPTURE_COMPARE_B_IRQHandler
GPT12_COMPARE_C_IRQHandler
GPT12_COMPARE_D_IRQHandler
GPT12_COMPARE_E_IRQHandler
GPT12_COMPARE_F_IRQHandler
GPT12_COUNTER_OVERFLOW_IRQHandler
GPT12_COUNTER_UNDERFLOW_IRQHandler
GPT13_CAPTURE_COMPARE_A_IRQHandler
GPT13_CAPTURE_COMPARE_B_IRQHandler
GPT13_COMPARE_C_IRQHandler
GPT13_COMPARE_D_IRQHandler
GPT13_COMPARE_E_IRQHandler
GPT13_COMPARE_F_IRQHandler
GPT13_COUNTER_OVERFLOW_IRQHandler
GPT13_COUNTER_UNDERFLOW_IRQHandler
OPS_UVW_EDGE_IRQHandler
EDMAC0_EINT_IRQHandler
SCI0_RXI_IRQHandler
SCI0_TXI_IRQHandler
SCI0_TEI_IRQHandler
SCI0_ERI_IRQHandler
SCI0_AM_IRQHandler
SCI0_RXI_OR_ERI_IRQHandler
SCI1_RXI_IRQHandler
SCI1_TXI_IRQHandler
SCI1_TEI_IRQHandler
SCI1_ERI_IRQHandler
SCI1_AM_IRQHandler
SCI2_RXI_IRQHandler
SCI2_TXI_IRQHandler
SCI2_TEI_IRQHandler
SCI2_ERI_IRQHandler
SCI2_AM_IRQHandler
SCI3_RXI_IRQHandler
SCI3_TXI_IRQHandler
SCI3_TEI_IRQHandler
SCI3_ERI_IRQHandler
SCI3_AM_IRQHandler
SCI4_RXI_IRQHandler
SCI4_TXI_IRQHandler
SCI4_TEI_IRQHandler
SCI4_ERI_IRQHandler
SCI4_AM_IRQHandler
SCI5_RXI_IRQHandler
SCI5_TXI_IRQHandler
SCI5_TEI_IRQHandler
SCI5_ERI_IRQHandler
SCI5_AM_IRQHandler
SCI6_RXI_IRQHandler
SCI6_TXI_IRQHandler
SCI6_TEI_IRQHandler
SCI6_ERI_IRQHandler
SCI6_AM_IRQHandler
SCI7_RXI_IRQHandler
SCI7_TXI_IRQHandler
SCI7_TEI_IRQHandler
SCI7_ERI_IRQHandler
SCI7_AM_IRQHandler
SCI8_RXI_IRQHandler
SCI8_TXI_IRQHandler
SCI8_TEI_IRQHandler
SCI8_ERI_IRQHandler
SCI8_AM_IRQHandler
SCI9_RXI_IRQHandler
SCI9_TXI_IRQHandler
SCI9_TEI_IRQHandler
SCI9_ERI_IRQHandler
SCI9_AM_IRQHandler
SPI0_RXI_IRQHandler
SPI0_TXI_IRQHandler
SPI0_IDLE_IRQHandler
SPI0_ERI_IRQHandler
SPI0_TEI_IRQHandler
SPI1_RXI_IRQHandler
SPI1_TXI_IRQHandler
SPI1_IDLE_IRQHandler
SPI1_ERI_IRQHandler
SPI1_TEI_IRQHandler
QSPI_INT_IRQHandler
SDHIMMC0_ACCS_IRQHandler
SDHIMMC0_SDIO_IRQHandler
SDHIMMC0_CARD_IRQHandler
SDHIMMC0_DMA_REQ_IRQHandler
SDHIMMC1_ACCS_IRQHandler
SDHIMMC1_SDIO_IRQHandler
SDHIMMC1_CARD_IRQHandler
SDHIMMC1_DMA_REQ_IRQHandler
SCE_PROC_BUSY_IRQHandler
SCE_ROMOK_IRQHandler
SCE_LONG_PLG_IRQHandler
SCE_TEST_BUSY_IRQHandler
SCE_WRRDY_0_IRQHandler
SCE_WRRDY_1_IRQHandler
SCE_WRRDY_4_IRQHandler
SCE_RDRDY_0_IRQHandler
SCE_RDRDY_1_IRQHandler
SCE_INTEGRATE_WRRDY_IRQHandler
SCE_INTEGRATE_RDRDY_IRQHandler
                B       .

                ENDP

                ALIGN

;*******************************************************************************
; User Stack and Heap initialization
;*******************************************************************************
;                 IF      :DEF:__MICROLIB

;                 EXPORT  __initial_sp
;                 EXPORT  __heap_base
;                 EXPORT  __heap_limit

;                 ELSE

;                 IMPORT  __use_two_region_memory
;                 EXPORT  __user_initial_stackheap

;__user_initial_stackheap

;                 LDR     R0, =  Heap_Mem
;                 LDR     R1, =(Stack_Mem + Stack_Size)
;                 LDR     R2, = (Heap_Mem +  Heap_Size)
;                 LDR     R3, = Stack_Mem
;                 BX      LR

;                 ALIGN

;                 ENDIF

                 END
